/**
 ******************************************************************************
 ** ファイル名 : ClockTimer.cpp
 **
 ** 概要 : ClockTimerクラス
 **
 ** 注記 : 各種初期パラメータは_prmファイル参照
 ******************************************************************************
 **/

#include "ClockTimer.h"
#include <string.h>

#define DEBUG

#ifdef DEBUG
#define _debug(x) (x)
#else
#define _debug(x)
#endif

//*****************************************************************************
// 関数名 : コンストラクタ
// 引数 : unused
// 返り値 : なし
// 概要 : 
//*****************************************************************************
ClockTimer::ClockTimer(){
    memset(&stopwatch_time, 0, STOPWATCH_MAX);
}

//*****************************************************************************
// 関数名 : デストラクタ
// 引数 : unused
// 返り値 : なし
// 概要 : 
//*****************************************************************************
ClockTimer::~ClockTimer(){

}

//*****************************************************************************
// 関数名 : StopWatch_Start
// 引数 : unused
// 返り値 : なし
// 概要 : 
//*****************************************************************************
void ClockTimer::StopWatch_Start(int8_t stopwatch_no){
    stopwatch_time[stopwatch_no] = now();
}

//*****************************************************************************
// 関数名 : StopWatch_Stot
// 引数 : unused
// 返り値 : なし
// 概要 : 
//*****************************************************************************
uint32_t ClockTimer::StopWatch_Stot(int8_t stopwatch_no){
    uint32_t ret;
    uint32_t now_time = now();
    ret = now_time - stopwatch_time[stopwatch_no];
    return(ret);
}
